Docs(design): 重构设计分档结构, 添加决策目录
Date: 2026/07/31 01:39

Finish:
1.
2.
3.

TODO:
1. 配置CI
2. 继续完善项目架构文档
3. 构建项目结构目录
